In [1]:
import sqlalchemy

In [4]:
sqlalchemy.create_engine("postgresql://postgres:***@localhost:5432/postgres_db")

Engine(postgresql://postgres:***@localhost:5432/postgres_db)

In [5]:
%load_ext sql

In [8]:
%sql postgresql://postgres:***@localhost:5432/analysis

'Connected: postgres@analysis'

In [11]:
%%sql

select * from teachers;

 * postgresql://postgres:***@localhost:5432/analysis
6 rows affected.

[(1, 'Janet', 'Smith', 'F.D. Roosevelt HS', datetime.date(2011, 10, 30), Decimal('36200')),
 (2, 'Lee', 'Reynolds', 'F.D. Roosevelt HS', datetime.date(1993, 5, 22), Decimal('65000')),
 (3, 'Samuel', 'Cole', 'Myers Middle School', datetime.date(2005, 8, 1), Decimal('43500')),
 (4, 'Samantha', 'Bush', 'Myers Middle School', datetime.date(2011, 10, 30), Decimal('36200')),
 (5, 'Betty', 'Diaz', 'Myers Middle School', datetime.date(2005, 8, 30), Decimal('43500')),
 (6, 'Kathleen', 'Roush', 'F.D. Roosevelt HS', datetime.date(2010, 10, 22), Decimal('38500'))]